load-test/api_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.29.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,4096,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /api/health
Document Length:        486 bytes

Concurrency Level:      5
Time taken for tests:   0.778 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      155400 bytes
HTML transferred:       97200 bytes
Requests per second:    256.99 [#/sec] (mean)
Time per request:       19.456 [ms] (mean)
Time per request:       3.891 [ms] (mean, across all concurrent requests)
Transfer rate:          195.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4    9   3.9      8      21
Processing:     1   10   3.8     11      17
Waiting:        1   10   3.9     11      17
Total:          5   19   3.9     19      27

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     23
  80%     23
  90%     23
  95%     24
  98%     27
  99%     27
 100%     27 (longest request)