load-test/health_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.29.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,4096,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /health
Document Length:        486 bytes

Concurrency Level:      10
Time taken for tests:   1.921 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      463000 bytes
HTML transferred:       243000 bytes
Requests per second:    260.28 [#/sec] (mean)
Time per request:       38.421 [ms] (mean)
Time per request:       3.842 [ms] (mean, across all concurrent requests)
Transfer rate:          235.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   19   2.5     19      37
Processing:     2   19   2.1     19      36
Waiting:        1   19   2.1     19      35
Total:         10   38   2.5     38      47

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     39
  75%     39
  80%     39
  90%     40
  95%     41
  98%     44
  99%     46
 100%     47 (longest request)