load-test/static_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Finished 300 requests


Server Software:        nginx/1.29.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_256_GCM_SHA384,4096,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /
Document Length:        28415 bytes

Concurrency Level:      10
Time taken for tests:   1.133 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      8689200 bytes
HTML transferred:       8524500 bytes
Requests per second:    264.84 [#/sec] (mean)
Time per request:       37.758 [ms] (mean)
Time per request:       3.776 [ms] (mean, across all concurrent requests)
Transfer rate:          7491.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   29   3.9     30      39
Processing:     2    9   3.4      7      30
Waiting:        0    8   3.4      7      30
Total:          7   37   4.4     37      48

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     38
  75%     39
  80%     40
  90%     42
  95%     45
  98%     45
  99%     46
 100%     48 (longest request)